INSERT INTO students(name, start_year)
VALUES ('Иванов К.И.', '2022.08.31'),
       ('Сидорова А.Г.', '2022.08.30'), 
       ('Стрельцов О.Ш.', '2021.08.31'),
       ('Сазонова Г. Т.', '2021.08.30'),
       ('Михайлов А.Е.', '2023.09.01');

SELECT * FROM students;

INSERT INTO courses(title, hours)
VALUES ('Прикладная математика и информатика', 82.0),
       ('Математика и компьютерные науки', 85.5), 
       ('Прикладная механика', 76.0),
       ('Мехатроника и робототехника', 74.8);
SELECT * FROM  courses;
   
INSERT INTO exams(s_id, c_no, score)
VALUES (1, 1, 5),
       (1, 2, 4),
       (1, 3, 3),
       (1, 4, 4),
       (2, 1, 4),
       (2, 2, 5),
       (2, 3, 3),
       (2, 4, 3),
       (3, 1, 3),
       (3, 2, 2),
       (3, 3, NULL),
       (3, 4, 3),
       (4, 1, null),
       (4, 2, null),
       (4, 3, null), 
       (4, 4, null),
       (5, 1, null), 
       (5, 2, null), 
       (5, 3, null), 
       (5, 4, null)
       ;      
SELECT * FROM exams;



